papers/tcst-14-replay.html
---
comments: true
layout: page
title: Detecting Integrity Attacks on SCADA Systems 
---
<hr />

<p>
<b>Yilin Mo, Rohan Chabukswar and Bruno Sinopoli</b>
</p>

<p>
<i>IEEE Transactions on Control System Technology</i>, Jul 2014, Volume 22, Issue 4, 1396-1407
</p>

<p>
Link to the <a href="../../../public/papers/j12replay.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Fj12replay.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org33964e5" class="outline-2">
<h2 id="org33964e5">Abstract</h2>
<div class="outline-text-2" id="text-org33964e5">
<p>
Ensuring security of systems based on supervisory control and data acquisition is a major challenge. The goal of this paper is to develop the model-based techniques capable of detecting integrity attacks on the sensors of a control system. In this paper, the effect of integrity attacks on the control systems is analyzed and countermeasures capable of exposing such attacks are proposed. The main contributions of this paper, beyond the novelty of the problem formulation, lies in enumerating the conditions of the feasibility of the replay attack, and suggesting countermeasures that optimize the probability of detection by conceding control performance. The methodologies are shown and the theoretical results are validated using several sets of simulations.
</p>
</div>
</div>
